tutorials/DLpisoFoam/with_PCA/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes                                                                 
{
    default         Euler; 
}

gradSchemes
{
    default         Gauss linear ;
}


divSchemes
{
    default 	none;
    div(phi,U)  Gauss limitedLinearV 1 grad(U);
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;//orthogonal
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;//orthogonal
}
fluxRequired
{
    default	no;
    p		;
}

// ************************************************************************* //
